---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.ExtensionsOverlapWarning
source: html/66a9b9d1-f915-b85b-39e0-5ba41c03ffc9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.ExtensionsOverlapWarning Property

Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtensionsOverlapWarning { get; }
```